added bugfix on Speed inpuit under Degraded, Updated Readme, also added diagram as stand alone file
